#Задание 2 "Калькулятор финансов"

print("Калькулятор финансов")

person1 = input("Введите зарплатные данные одного человека: ")
person2 = input("Введите зарплатные данные второго человека: ")
person3 = input("Введите зарплатные данные третьего человека: ")

аverage = (int(person1) + int(person2) + int(person3)) / 3

print(аverage)